{"inkVersion":20,"root":[[{"->":"start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"start":[["^I am Another Wor Magic School 2nd grade Class 4! Today is a fun vacation day. I was on my way home with my bag on my back. ",{"#":"img:0"},"\n","^However, while all the teachers were there, only <b>teacher Basil</b> was not seen. What a strange thing to do... It's hard not to notice the <i>shining face</i>.","\n","^Oh, by the way, teacher Basil is <b>teaching me alchemy</b> !","\n","^Originally, school doesn't teach alchemy, but I've been learning it since I happened to see the teacher's alchemy. It's a lot more fun than magic. :)","\n","^I wanted to say hello to my teacher and go home... Where did teacher go? While I was questioning, a very, very surprising situation unfolded!","\n","^\" Help me!!! \" \" ",{"#":"name:???"},"\n","^A small voice was heard somewhere. The source of the voice was a  Mouse doll hanging from my bag. ",{"#":"img:1"},"\n","^It's a doll that was always near you, but since when did it start hanging there? No, but why are you talking???","\n","^\" I'm basically your <b>assistant</b>! It's a mouse! \" ",{"#":"name: Mouse"},"\n","^It was embarrassing. By the way, did you name it <b> Mouse</b> because it looks like a mouse? You're too mean... :(","\n","^\" Help my master! Someone took the master as the basis!!!\" ",{"#":"name: Mouse"},"\n","^\" Fortunately, if you track down the union method you created, you'll know where you are! \" ",{"#":"name: Mouse"},"\n","^\" Help me get my master back!!! \" ",{"#":"name: Mouse"},"\n","^The mouse murmured. I can't believe someone took you! It's still shocking... At that time, I","\n",["ev",{"^->":"start.0.35.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^\" Not my jam. \"",{"->":"$r","var":true},null]}],["ev",{"^->":"start.0.36.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^\" Yes! I'll help you. \"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"start.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.35.s"},[{"#n":"$r2"}],"\n","^I said ","<>","^. There are a lot of things to do during vacation! And I couldn't believe it.","\n","^However, after the mouse's persuasion, teacher found out that the story was true and decided to save the teacher.","\n",{"->":"intro"},{"#f":5}],"c-1":["ev",{"^->":"start.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.36.s"},[{"#n":"$r2"}],"\n","^I said ","<>","^. I can't believe you're gone.. I can't believe I can't see that face like a national treasure again!!! I can't do that. I'll find it no matter what.","\n",{"->":"intro"},"end",{"#f":5}]}],{"#f":1}],"intro":["^So I decided to go on a journey to save my teacher. During the vacation, <b>for 30 days!</b>  ",{"#":"img:2"},"\n","^What kind of adventure awaits? My heart is pounding!","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}