{"inkVersion":20,"root":[[{"->":"tuto_0"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"tuto_0":["^Welcome to the tutorial!","\n","^Basically, where the hell are you?","\n","^Let's <b>Decrypt</b> your research (combination method) for <b>30 days</b> and make your research tool!","\n","^First, let's look at <b>[Decryption]</b>?","\n","end",{"#f":1}],"tuto_1":["^Here you can interpret your research (combination)","\n","^First, shall we do the <b>diagnostic evaluation</b>?","\n","^The answer can be selected through <b>drag</b>!","\n","end",{"#f":1}],"tuto_2":["^Good job!","\n","^Let's interpret the union law this time.","\n","^Click <b>Basic Combination Act 1</b> and press <b>Interpretation</b>!","\n","^Out of a total of 8 questions, If you get more than <b>6 questions correct</b>, you can interpret the combination method.","\n","end",{"#f":1}],"tuto_3":["^You failed to interpret it. It's okay!","\n","^Shall we try again?","\n","end",{"#f":1}],"tuto_4":["^That's great!","\n","^This time, let's try alchemy using the combination method we obtained.","\n","end",{"#f":1}],"tuto_5":["^This is a combination space <b> where you can try alchemy.","\n","^It's a place where we can lift our goal of research tools!","\n","^Before that, let's check the combination method we interpreted?","\n","^Click <b>Book</b> in the upper left and check the combination method obtained.","\n","end",{"#f":1}],"tuto_6":["^You interpreted the <b>glass</b> combination method. That's great!","\n","^The final goal <b>Recipe of research tools</b> is also available here.","\n","^This time, let's use this combination method to make <b>glass</b> yourself!","\n","^Return to <b>combination space</b>.","\n","end",{"#f":1}],"tuto_7":["^Welcome!","\n","^Oh, no, there's no ingredient to combine.","\n","^Don’t you worry! I'll give you the ingredients you need.","\n","^In the future, you can obtain materials from <b>[Adventure]</b>.","\n","^For reference, <b>fire</b> comes from <b>forest</b>, and <b>water</b> comes from <b>winter sea</b>.","\n","^The deeper you go, the more new materials you can get!","\n","^Shall we make glass now?","\n","^Drag the material onto the <b>sawwheel shape</b> and press the <b>watch </b> in the middle!","\n","end",{"#f":1}],"tuto_8":["^You did a great job!","\n","^In the future, we will continue to <b>interpret</b> the combination method and ,","\n","^Get the ingredients you need from <b>adventure</b>,","\n","^Use alchemy to combine ingredients!","\n","^That's it for the tutorial.","\n","^I look forward to your great adventure!","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}